2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_TechnischToegang/data/VerAntwVulberichtHappyflowGeboorteMetErkenning-TC01-4-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670000</ABONNEMENT>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>5fa6a37a-c8c4-47a1-8dd3-6d245fbfd095</brp:referentienummer>
    <brp:tijdstipVerzending>2014-08-13T15:46:39.424+02:00</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Volledigbericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Geen pop.bep. levering op basis van doelbinding</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling">
    <brp:code>01002</brp:code>
    <brp:naam>Geboorte in Nederland met erkenning</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>036101</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:communicatieID="1">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>900188005</brp:burgerservicenummer>
          <brp:administratienummer>9098517169</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>J</brp:indicatieNamenreeks>
          <brp:geslachtsnaamstam>Brest naar Kempen</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datum>${vandaag(0,0,-2)}</brp:datum>
          <brp:gemeenteCode>1773</brp:gemeenteCode>
          <brp:woonplaatsnaam>Blauwestad</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:code>V</brp:code>
        </brp:geslachtsaanduiding>
        <brp:inschrijving>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datum>${vandaag(0,0,-2)}</brp:datum>
        </brp:inschrijving>
        <brp:bijhouding>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
          <brp:partijCode>034401</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:geslachtsnaamcomponenten>
          <brp:geslachtsnaamcomponent brp:objecttype="PersoonGeslachtsnaamcomponent">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
            <brp:volgnummer>1</brp:volgnummer>
            <brp:stam>Brest naar Kempen</brp:stam>
          </brp:geslachtsnaamcomponent>
        </brp:geslachtsnaamcomponenten>
        <brp:naamgebruik>
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>${result}</brp:actieInhoud>
          <brp:code>E</brp:code>
          <brp:voornamen>Marlies Marleen</brp:voornamen>
          <brp:geslachtsnaamstam>Brest naar Kempen</brp:geslachtsnaamstam>
        </brp:naamgebruik>
        <brp:adressen>
          <brp:adres brp:objecttype="PersoonAdres">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>A</brp:redenWijzigingCode>
            <brp:datumAanvangAdreshouding>${vandaag(0,0,-2)}</brp:datumAanvangAdreshouding>
            <brp:gemeenteCode>0344</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>Vredenburg</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>Vredenburg</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>3</brp:huisnummer>
            <brp:postcode>3511BA</brp:postcode>
            <brp:woonplaatsnaam>Smalle Ee</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
        </brp:adressen>
        <brp:nationaliteiten>
          <brp:nationaliteit brp:objecttype="PersoonNationaliteit">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
            <brp:nationaliteitCode>0001</brp:nationaliteitCode>
            <brp:redenVerkrijgingCode>018</brp:redenVerkrijgingCode>
          </brp:nationaliteit>
          <brp:nationaliteit brp:objecttype="PersoonNationaliteit">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
            <brp:nationaliteitCode>0083</brp:nationaliteitCode>
          </brp:nationaliteit>
        </brp:nationaliteiten>
        <brp:betrokkenheden>
          <brp:kind brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:familierechtelijkeBetrekking brp:objecttype="Relatie" brp:objectSleutel="*">
              <brp:betrokkenheden>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:persoon brp:objecttype="Persoon">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers>
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1977-12-10</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>900171868</brp:burgerservicenummer>
                      <brp:administratienummer>9036180623</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam>*</brp:samengesteldeNaam>
                    <brp:geboorte>*</brp:geboorte>
                    <brp:geslachtsaanduiding>*</brp:geslachtsaanduiding>
                  </brp:persoon>
                  <brp:ouderschap brp:voorkomenSleutel="*">
                    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                    <brp:actieInhoud>*</brp:actieInhoud>
                    <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
                  </brp:ouderschap>
                </brp:ouder>
                <brp:ouder brp:objecttype="Betrokkenheid" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:persoon brp:objecttype="Persoon">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers>
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>1988-04-25</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>900100540</brp:burgerservicenummer>
                      <brp:administratienummer>9068198053</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam>*</brp:samengesteldeNaam>
                    <brp:geboorte>*</brp:geboorte>
                    <brp:geslachtsaanduiding>*</brp:geslachtsaanduiding>
                  </brp:persoon>
                  <brp:ouderschap brp:voorkomenSleutel="*">
                    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                    <brp:actieInhoud>*</brp:actieInhoud>
                    <brp:datumAanvangGeldigheid>${vandaag(0,0,-2)}</brp:datumAanvangGeldigheid>
                  </brp:ouderschap>
                </brp:ouder>
              </brp:betrokkenheden>
            </brp:familierechtelijkeBetrekking>
          </brp:kind>
        </brp:betrokkenheden>
        <brp:administratieveHandelingen>
          <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling" brp:objectSleutel="*">
            <brp:code>01002</brp:code>
            <brp:naam>Geboorte in Nederland met erkenning</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>036101</brp:partijCode>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:communicatieID="*">
                <brp:document brp:objecttype="Document" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:soortNaam>Geboorteakte</brp:soortNaam>
                  <brp:identificatie>GA0530-1C0001</brp:identificatie>
                  <brp:aktenummer>1CA0001</brp:aktenummer>
                  <brp:partijCode>036101</brp:partijCode>
                </brp:document>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="*">
                <brp:soortNaam>Registratie geboorte</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="*">
                <brp:soortNaam>Registratie identificatienummers</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="*">
                <brp:soortNaam>Registratie ouder</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie${result}">
                <brp:soortNaam>Registratie naamgebruik</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="*">
                <brp:soortNaam>Registratie nationaliteit</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="*">
                <brp:soortNaam>Registratie nationaliteit</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
        </brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
            <NAAM>Geen pop.bep. levering op basis van doelbinding</NAAM>
        </Row>
    </ResultSet>
</Results>